In [4]:
import pandas as pd
import numpy as np

In [ ]:
# ¿Qué diferencia hay entre una Serie y un Dataframe?
# La serie tiene una dimensión y el DataFrame tiene dos

In [ ]:
# Momento de trabajar con Series. Contestas las siguientes preguntas:
# Crea dos listas:
# Una que se llame "valores" que tenga 7 números aleatorios.
# Otra que se llame "indices" que tenga 7 strings que se llamen como los dias de la semana.

In [5]:
valores = np.random.randint(0,15, (7))
indices = ["Lunes", "Martes", "Miercoles", "Jueves", "Viernes", "Sabado", "Domingo"]

In [ ]:
# A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie 
# y la variable indices sean los índices de la Serie.

serie = pd.Series(valores, indices)
serie

In [10]:
# A partir de las dos listas anteriores crea un diccionario usando un for. 
# Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método aquí.


diccionario_global = {}
for key,value in zip(indices, valores):   
    diccionario = {key:value}                             #podríamos evitar variable diccionario
    diccionario_global.update(diccionario)
print(diccionario_global)

{'Lunes': 0, 'Martes': 2, 'Miercoles': 6, 'Jueves': 1, 'Viernes': 9, 'Sabado': 3, 'Domingo': 0}

In [12]:
# Crea una Serie con el diccionario creado en el punto anterior.

serie_diccionario = pd.Series(diccionario_global)
serie_diccionario

Lunes        0
Martes       2
Miercoles    6
Jueves       1
Viernes      9
Sabado       3
Domingo      0
dtype: int64

In [13]:
# Forma, tamaño, índices y values
print("Esta es la forma de nuestra serie", serie_diccionario.shape)

Esta es la forma de nuestra serie (7,)

In [14]:
print("Este es el tipo de nuestra serie" , serie_diccionario.dtypes)

Este es el ti po de nuestra serie int64

In [15]:
print("Este es el tamaño de nuestra serie", serie_diccionario.size)

Este es el tamaño de nuestra serie 7

In [16]:
print("Estos son los valores de nuestra serie", serie_diccionario.values)

Estos son los valores de nuestra serie [0 2 6 1 9 3 0]

In [26]:
# Extraed el valor para el índice "lunes"

serie_diccionario["Lunes"]

0

In [32]:
# Extraed el valor para el índice "lunes", "martes" y "miércoles"

print(serie_diccionario["Lunes"], serie_diccionario["Martes"], serie_diccionario["Miercoles"])

0 2 6

In [33]:
# Extraed el valor para el índice "lunes" y "domingo"
serie_diccionario["Lunes"], serie_diccionario["Domingo"]

(0, 0)

DataFrames

In [ ]:
# Cread un array de dos dimensiones con 4 filas y 3 columnas.
array_df = np.random.randint(0,100,(4,3))
dataframe = pd.DataFrame(array_df)

In [21]:
# Convertid el array en un dataframe donde las columnas se llamen "España", "Francia" e "Italia".
dataframe.rename(columns = {0:"España", 1:"Francia", 2:"Italia"}, inplace = True)
dataframe

   España  Francia  Italia
0      40       51      68
1      86       78      18
2      78       44      31
3      80       19      67

In [35]:
# Descargad el archivo "medallas" y cargad el dataframe con la siguiente líena de código:
df = pd.read_csv("medallas.csv", index_col=["País"])
df

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [36]:
# 📌 NOTA Para evitar problemas guardar el archivo medallas.csv a la misma altura que el jupyter donde estamos trabajando.
# Usando el loc extraed todas las columnas de la fila.
df.loc["China",:]

Unnamed: 0       1
Oro           1473
Plata          994
Bronce         720
Name: China, dtype: int64

In [37]:
# Usando el loc extraed todas las columnas de China e Irán.
df.loc[["China","Irán"],:]

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

In [38]:
# Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.
df.loc[["China","Irán"],["Oro", "Plata", "Bronce"]]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

In [50]:
###################################
# Usando el iloc extraed la información de la India. Devolved todas las columnas

# indice_india = df.iloc["India",:]
# indice_india
df["India",:]
# df.iloc[indice_india - 1]

TypeError: '('India', slice(None, None, None))' is an invalid key

In [54]:
# Usando el iloc extraed todas las columnas de los paises que estén en posición impar. 
# La primera que nos tendría que salir es Japón y la última Corea del Norte.

df.iloc[1:10:2]

# 🌷asumimos posición impar como índice impar

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Irán                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

In [52]:
#comprando que son los países impares
df

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [56]:
#####################################
# Utilizando el código del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".
df.iloc[[1:10:2],1:4]

SyntaxError: invalid syntax (3780749530.py, line 2)

In [57]:
# ¿Qué país consiguió más de 200 medallas de oro?
df.loc[df.Oro > 200,:]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [58]:
# ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?
df.loc[(df.Oro > 200) & (df.Plata > 1000)]

       Unnamed: 0   Oro  Plata  Bronce
País
Japón           2  1032   1037     985

In [59]:
# ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?
df.loc[(df.Oro > 200) | (df.Plata > 700)]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [60]:
# Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.
df2 = df.copy()

In [61]:
# df2.drop(df2.loc("Unnamed: 0"))
df2.drop("Unnamed: 0", inplace=True, axis=1) 
df2

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

In [62]:
# Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.
df["Total"] = (df["Oro"]+ df["Plata"] + df["Bronce"])
df

                 Unnamed: 0   Oro  Plata  Bronce  Total
País
China                     1  1473    994     720   3187
Japón                     2  1032   1037     985   3054
Corea del Sur             3   745    663     827   2235
Irán                      4   179    181     197    557
Kazajistán                5   155    158     224    537
India                     6   154    202     315    671
Tailandia                 7   132    175     278    585
Indonesia                 8   112    131     240    483
China Taipéi              9    99    144     276    519
Corea del Norte          10    91    120     235    446